# El objetivo es encontrar patrones en los datos "train.csv" que nos ayuden a predecir si los pasajeros del dataset "test.csv" sobrevivieron o no.

In [1]:
import numpy as np 
import pandas as pd 
import os

# Datos de Entrenamiento

### Pclass=Tipo de boleto (Clase)
### SibSp=Número hermanos/familiares en el titanic (siblings/Spouse)
### ParCh=Número de padres/número de niños(Parents/Children) 
### Fare=Tarifa(Valor del Pasaje)

In [2]:
datos_entrenamiento = pd.read_csv("/home/jonathan/tesis/5to_avance/Ejemplos/titanic/train.csv")
datos_entrenamiento.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Datos de Prueba

In [15]:
datos_Prueba = pd.read_csv("/home/jonathan/tesis/5to_avance/Ejemplos/titanic/test.csv")
datos_Prueba.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# Para la busqueda de los patrones
### Observamos el porcentaje de mujeres que sobrevivieron

In [4]:
women = datos_entrenamiento.loc[datos_entrenamiento.Sex == 'female']["Survived"] # columna "survived" compuesta por 1 y 0
rate_women = sum(women)/len(women) # Suma la columna "survived"de 1 y 0, los 0 no suman nada se descartan aquellas mujeres que fallecieron

print("% of women who survived:", rate_women)

% of women who survived: 0.7420382165605095

### Observamos el porcentajede hombres que sobrevivieron

In [5]:
men = datos_entrenamiento.loc[datos_entrenamiento.Sex == 'male']["Survived"]
rate_men = sum(men)/len(men)

print("% of men who survived:", rate_men)

% of men who survived: 0.18890814558058924

# Creamos el modelo y creamos un nuevo archivo csv con los resultados de la predicción

In [7]:
from sklearn.ensemble import RandomForestClassifier   # Importamos librerias ML

y = datos_entrenamiento["Survived"]       #Guardamos en la variable y los datos de la columna survived 

features = ["Pclass", "Sex", "SibSp", "Parch"] #Creamos una lista con las las columnas relevantes para la predicción
X = pd.get_dummies(datos_entrenamiento[features])        #Indica la presencia con un 1 lógico de cada una de las variables 
X_test = pd.get_dummies(datos_Prueba[features])    #Indica la presencia con un 1 lógico

model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)  #Creamos un modelo randomForest
model.fit(X, y)                              #Entrenams nuestro modelo con las variables relevantes y con los resultados de sobrevivientes
predictions = model.predict(X_test)          #Realizamos una predicción teniendo en cuenta las variables con las que fue entrenado el modelo 

output = pd.DataFrame({'PassengerId': datos_Prueba.PassengerId, 'Survived': predictions}) #Creamos un dataFrame con 2 columnas "Passengerid" y una columna "Survived" que contiene las predicciones 
output.to_csv('submission.csv', index=False)               #Convertimos a un archivo csv
print("Your submission was successfully saved!")

Your submission was successfully saved!

In [16]:
X.tail()

     Pclass  SibSp  Parch  Sex_female  Sex_male
886       2      0      0           0         1
887       1      0      0           1         0
888       3      1      2           1         0
889       1      0      0           0         1
890       3      0      0           0         1